import { FaqLists } from "../components/types/faqLists";

export const faqLists: FaqLists[] = [
    {
        question: "部費はかかりますか？",
        answer: "部費は一切かかりません。活動にかかる費用はすべて大学の予算で賄っています。"
    },
    {
        question: "サークルに参加するには、どうすれば良いですか？",
        answer: "新入生の方は、入学後最初にある「推奨/非推奨機ガイダンス」の空き時間にサークル説明会に参加することができます。\n(開催場所は毎年異なる可能性がございますので、公式Twitterをご覧ください。)\nこの説明会にお越しいただければサークル説明・入部のご案内が可能です！\n在学生の方は、直接部室や活動場所にお越しいただくか、公式TwitterにDMをお送りください。"
    },
    {
        question: "毎週の活動場所 or 部室に直接行っても良いですか？",
        answer: "全然大丈夫です！その場でサークル説明や入部案内をさせていただきます！"
    },
    {
        question: "他のサークルと兼部することは可能ですか？",
        answer: "可能です。特にLinuxClubではLT会などをハイブリット開催しているため、他のサークルとの兼部もしやすいです。"
    },
    {
        question: "プログラミング未経験ですが大丈夫ですか？",
        answer: "大丈夫ですが、本格的なアプリケーション開発を行いたいと考えている場合は、少しでもご自身で学習を進められることを推奨します。\n学習を進める上で新たに書籍を買う必要はなく、部室には多くの技術書が蔵書されていますので、ご自身の興味に合わせて本を選び、自習を進めましょう。(本選びで迷った際はぜひ先輩に聞いてみましょう)\n部室に来訪することが難しい場合は、インターネット上の入門記事(QiitaやZenn)を参考にするのも良いです。\n※入部後に勉強会を実施する場合がありますが、新学期は幹部も忙しく、積極的なイベント開催が行われないことが多いです。"
    },
    {
        question: "LT会の登壇内容はどのようなレベルを要求されますか？",
        answer: "特にレベルは問いません。自分が学んだことを発表するだけでOKです。(例: TCP/IPの仕組み、自作アプリ/サービスの紹介・工夫点など)\n(※技術的なテーマが望ましいですが、「お気に入りのラーメン店紹介」などでも大丈夫です！)"
    },
    {
        question: "Linuxについて詳しい先輩はいますか？",
        answer: '"Linuxについて詳しい"という言葉がどのスコープまでの話をしているのかはわかりかねますが、日常生活(講義を受ける・レポートを提出)をLinux OSでこなす先輩に出会うことができます。\nLinuxカーネルについて深い知識がある場合は、ぜひ入部して知見を共有してください。'
    },
    {
        question: "新しいプロジェクトを立ち上げたいですが、どうすれば良いですか？",
        answer: "幹部(部長・会計)にご相談ください。お話を伺った上で、プロジェクトの立ち上げをサポートいたします。"
    },
    {
        question: "ハッカソンに参加したいですが、どうすれば良いですか？",
        answer: "ぜひ部員を募って、参加してください！\n参加費用がかかる場合は、内容次第で部費から補助を出すことも可能です。"
    }
];
